Tsuki562/Embedded-Terminal/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.5.2 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_40M=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_COMPILER_ORPHAN_SECTIONS_PLACE=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_250M=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_SPIRAM_USE_CAPS_ALLOC=y
# Allocate mbedTLS/TLS working buffers from PSRAM so concurrent MQTTS (TLS)
# connections don't exhaust internal/DMA RAM needed by the SDIO WiFi driver.
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y
CONFIG_ESP_SYSTEM_PANIC_PRINT_HALT=y
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_VTASKLIST_INCLUDE_COREID=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
CONFIG_FREERTOS_TASK_CREATE_ALLOW_EXT_MEM=y
CONFIG_VFS_MAX_COUNT=15
CONFIG_ESP_BROOKESIA_LOG_STYLE_STD=y
CONFIG_ESP_BROOKESIA_MEMORY_USE_CUSTOM=y
CONFIG_BSP_LCD_DPI_BUFFER_NUMS=3
CONFIG_LV_COLOR_SCREEN_TRANSP=y
CONFIG_LV_MEM_CUSTOM=y
CONFIG_LV_MEM_CUSTOM_INCLUDE="esp_heap_caps.h"
CONFIG_LV_MEMCPY_MEMSET_STD=y
CONFIG_LV_DISP_DEF_REFR_PERIOD=15
CONFIG_LV_CIRCLE_CACHE_SIZE=10
CONFIG_LV_LAYER_SIMPLE_BUF_SIZE=65536
CONFIG_LV_IMG_CACHE_DEF_SIZE=20
CONFIG_LV_GRAD_CACHE_DEF_SIZE=10240
CONFIG_LV_ATTRIBUTE_FAST_MEM_USE_IRAM=y
CONFIG_LV_FONT_MONTSERRAT_8=y
CONFIG_LV_FONT_MONTSERRAT_10=y
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_22=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_26=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_30=y
CONFIG_LV_FONT_MONTSERRAT_32=y
CONFIG_LV_FONT_MONTSERRAT_34=y
CONFIG_LV_FONT_MONTSERRAT_36=y
CONFIG_LV_FONT_MONTSERRAT_38=y
CONFIG_LV_FONT_MONTSERRAT_40=y
CONFIG_LV_FONT_MONTSERRAT_42=y
CONFIG_LV_FONT_MONTSERRAT_44=y
CONFIG_LV_FONT_MONTSERRAT_46=y
CONFIG_LV_FONT_MONTSERRAT_48=y
CONFIG_LV_FONT_SIMSUN_16_CJK=y
CONFIG_LV_FONT_DEFAULT_SIMSUN_16_CJK=y
CONFIG_LV_TXT_ENC_UTF8=y
CONFIG_LV_USE_MONKEY=y
CONFIG_LV_USE_DEMO_WIDGETS=y
CONFIG_LV_USE_DEMO_BENCHMARK=y
CONFIG_LV_USE_DEMO_STRESS=y
CONFIG_IDF_EXPERIMENTAL_FEATURES=y

# ESP32-P4-Function-EV-Board uses the on-board ESP32-C6 over SDIO for Wi-Fi.
CONFIG_SLAVE_IDF_TARGET_ESP32C6=y
CONFIG_ESP_HOSTED_CP_TARGET_ESP32C6=y
CONFIG_ESP_HOSTED_P4_DEV_BOARD_FUNC_BOARD=y
CONFIG_ESP_HOSTED_SDIO_HOST_INTERFACE=y
# CONFIG_ESP_HOSTED_SPI_HOST_INTERFACE is not set

CONFIG_WIFI_RMT_STATIC_RX_BUFFER_NUM=8
CONFIG_WIFI_RMT_DYNAMIC_RX_BUFFER_NUM=16
CONFIG_WIFI_RMT_DYNAMIC_TX_BUFFER_NUM=16
CONFIG_WIFI_RMT_AMPDU_TX_ENABLED=y
CONFIG_WIFI_RMT_TX_BA_WIN=8
CONFIG_WIFI_RMT_AMPDU_RX_ENABLED=y
CONFIG_WIFI_RMT_RX_BA_WIN=8
CONFIG_ESP_HOSTED_SDIO_TX_Q_SIZE=4
CONFIG_ESP_HOSTED_SDIO_RX_Q_SIZE=4
CONFIG_ESP_HOSTED_DFLT_TASK_FROM_SPIRAM=y
# CONFIG_ESP_HOSTED_MEM_MONITOR is not set
# CONFIG_ESP_HOSTED_ENABLE_ITWT is not set
# CONFIG_ESP_HOSTED_CLI_ENABLED is not set
CONFIG_ESP_HOSTED_ENABLE_PEER_DATA_TRANSFER=y
CONFIG_ESP_HOSTED_MAX_CUSTOM_MSG_HANDLERS=1

# HomeCare MQTT can use mqtts:// or wss:// brokers with the ESP certificate bundle.
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y
CONFIG_HOMECARE_MQTT_BROKER_URI=""
CONFIG_HOMECARE_MQTT_CLIENT_ID="homecare-hub"
CONFIG_HOMECARE_MQTT_USERNAME=""
CONFIG_HOMECARE_MQTT_PASSWORD=""
CONFIG_HOMECARE_MQTT_INBOUND_CMD_TOPIC="smartcar/cmd"

# CameraMode MQTT viewer. Configure broker/user/password locally via menuconfig.
CONFIG_CAMERA_MQTT_ENABLE=y
CONFIG_CAMERA_MQTT_BROKER_URI="mqtts://x3a5a71f.ala.cn-hangzhou.emqxsl.cn:8883"
CONFIG_CAMERA_MQTT_CLIENT_ID="brookesia-camera-viewer"
CONFIG_CAMERA_MQTT_USERNAME=""
CONFIG_CAMERA_MQTT_PASSWORD=""
CONFIG_CAMERA_MQTT_JPEG_TOPIC="cam/jpeg"
CONFIG_CAMERA_MQTT_CONTROL_TOPIC=""
CONFIG_CAMERA_MQTT_STATUS_TOPIC=""
CONFIG_CAMERA_MQTT_MAX_JPEG_BYTES=262144
CONFIG_CAMERA_MQTT_BUFFER_SIZE=8192
CONFIG_CAMERA_MQTT_DECODE_TASK_STACK=8192
CONFIG_CAMERA_MQTT_DECODE_TASK_PRIORITY=5
# CONFIG_MQTT_PROTOCOL_311 is not set
CONFIG_MQTT_PROTOCOL_5=y
CONFIG_MQTT_TOPIC_PRESENT_ALL_DATA_EVENTS=y
